/*Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

14212 -> нет

12821 -> да

23432 -> да*/

Console.WriteLine("Введите пятизначное число");
int palidrom = int Parse(Console.ReadLine());
int i = 0
int palidromMax = 4;

if (palidrom[i] == palidromMax; i++; palidromMax -1;)
{
     Console.WriteLine($" {i} ");
} 
